export const content =
  '꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다. 꾸준히 열심하 하실 분 찾습니다.';

export const tags = [
  { id: 1, content: 'ts' },
  { id: 2, content: 'js' },
  { id: 3, content: '프론트' },
  { id: 4, content: 'ts' },
  { id: 5, content: 'js' },
  { id: 6, content: '프론트' },
  { id: 7, content: 'ts' },
  { id: 8, content: 'js' },
  { id: 9, content: '프론트' },
  { id: 10, content: 'ts' },
  { id: 11, content: 'js' },
  { id: 12, content: '프론트' },
  { id: 13, content: 'ts' },
  { id: 14, content: 'js' },
  { id: 15, content: '프론트' },
].map((tag) => ({ id: tag.id, content: `#${tag.content}` }));

export const infos = [
  {
    id: 1,
    type: 'start',
    content: '2022-08-25',
  },
  {
    id: 2,
    type: 'studyWay',
    content: '오프라인',
  },
  {
    id: 3,
    type: 'limit',
    content: '5명',
  },
  // {
  //   id: 4,
  //   type: 'end',
  //   content: '2022-09-25',
  // },
  {
    id: 5,
    type: 'district',
    content: '서울',
  },
];

export const title = 'typescript 스터디 모집 typescript 스터디 모집';

export const districts = [
  {
    id: 1,
    type: 'district',
    content: '서울',
  },
  {
    id: 2,
    type: 'district',
    content: '부산',
  },
  {
    id: 3,
    type: 'district',
    content: '대구',
  },
  {
    id: 4,
    type: 'district',
    content: '인천',
  },
  {
    id: 5,
    type: 'district',
    content: '대전',
  },
  {
    id: 6,
    type: 'district',
    content: '울산',
  },
];

export const postings = [
  {
    id: 1,
    nickName: '이든',
    time: '10분전',
    title,
    infos,
    viewCount: 15,
    likeCount: 7,
    commentCount: 3,
    isRecruiting: true,
    content,
    tags,
    createdDate: '2022-08-12',
    maxStudyMemberCount: 5,
    currentStudyMemberCount: 1,
  },
  {
    id: 2,
    nickName: '준',
    time: '20분전',
    title,
    infos,
    viewCount: 15,
    likeCount: 7,
    commentCount: 3,
    isRecruiting: true,
    content,
    tags,
    createdDate: '2022-08-12',
    maxStudyMemberCount: 5,
    currentStudyMemberCount: 1,
  },
  {
    id: 3,
    nickName: '준',
    time: '20분전',
    title,
    infos,
    viewCount: 15,
    likeCount: 7,
    commentCount: 3,
    isRecruiting: true,
    content,
    tags,
    createdDate: '2022-08-12',
    maxStudyMemberCount: 5,
    currentStudyMemberCount: 1,
  },
  {
    id: 4,
    nickName: '준',
    time: '20분전',
    title,
    infos,
    viewCount: 15,
    likeCount: 7,
    commentCount: 3,
    isRecruiting: true,
    content,
    tags,
    createdDate: '2022-08-12',
    maxStudyMemberCount: 5,
    currentStudyMemberCount: 1,
  },
];

export const tabs = [
  {
    id: 4,
    content: '최신순',
  },
  {
    id: 5,
    content: '좋아요순',
  },
  {
    id: 6,
    content: '댓글순',
  },
  {
    id: 7,
    content: '스크랩순',
  },
];

export const progressTabs = [
  {
    id: 1,
    content: '전체',
  },
  {
    id: 2,
    content: '모집중',
  },
  {
    id: 3,
    content: '모집완료',
  },
];

export type tabsType = typeof tabs;
